// /*++
// Copyright (c) 2009 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// --*/
/=#
#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US "English"

#string STR_CHIP_NB_REV_HELP                          #language en-US "GMCH Version"
                                                      #language zh-Hans "GMCH Version"
#string STR_CHIP_NB_REV_NAME                          #language en-US "GMCH Version"
                                                      #language zh-Hans "GMCH Version"
#string STR_CHIP_NB_REV_VALUE                         #language en-US "N/A" //dynamically updated
                                                      #language zh-Hans "N/A" //dynamically updated
#string STR_CHIP_SB_NAME_HELP                         #language en-US "PCH Name"
                                                      #language zh-Hans "PCH Name"
#string STR_CHIP_SB_NAME                              #language en-US "Name"
                                                      #language zh-Hans "Name"
#string STR_CHIP_SB_VALUE                             #language en-US "UnKnown" //dynamically updated
                                                      #language zh-Hans "UnKnown" //dynamically updated
#string STR_CHIP_SB_REV_HELP                          #language en-US "PCH Stepping"
                                                      #language zh-Hans "PCH Stepping"
#string STR_CHIP_SB_REV_NAME                          #language en-US "Stepping"
                                                      #language zh-Hans "Stepping"
#string STR_CHIP_SB_REV_VALUE                         #language en-US "UnKnown" //dynamically updated
                                                      #language zh-Hans "UnKnown" //dynamically updated
#string STR_CHIP_SB_PACKAGE_HELP                      #language en-US "PCH Package"
                                                      #language zh-Hans "PCH Package"
#string STR_CHIP_SB_PACKAGE_NAME                      #language en-US "Package"
                                                      #language zh-Hans "Package"
#string STR_CHIP_SB_PACKAGE_VALUE                     #language en-US "N/A" //dynamically updated
                                                      #language zh-Hans "N/A" //dynamically updated
#string STR_PLATFORM_TXT_HELP                         #language en-US "Platform/PCH TXT capability"
                                                      #language zh-Hans "Platform/PCH TXT capability"
#string STR_PLATFORM_TXT_NAME                         #language en-US "TXT Capability of Platform/PCH"
                                                      #language zh-Hans "TXT Capability of Platform/PCH"
#string STR_PLATFORM_TXT_VALUE                        #language en-US "Not Supported" //dynamically updated
                                                      #language zh-Hans "Not Supported" //dynamically updated
#string STR_CHIP_EC_REV_HELP                          #language en-US "KSC EC Version"
                                                      #language zh-Hans "KSC EC Version"
#string STR_CHIP_EC_REV_NAME                          #language en-US "KSC EC Version"
                                                      #language zh-Hans "KSC EC Version"
#string STR_CHIP_EC_REV_VALUE                         #language en-US "N/A" //dynamically updated
                                                      #language zh-Hans "N/A" //dynamically updated
#string STR_ME_FW_SKU_HELP                            #language en-US  "ME Firmware SKU"
                                                      #language zh-Hans  "ME Firmware SKU"
#string STR_ME_FW_SKU_PROMPT                          #language en-US  "ME Firmware SKU"
                                                      #language zh-Hans  "ME Firmware SKU"
#string STR_ME_FW_SKU_VALUE                           #language en-US  "N/A" //dynamically updated
                                                      #language zh-Hans  "N/A" //dynamically updated
#string STR_ME_FW_REV_HELP                            #language en-US  "ME Firmware Version"
                                                      #language zh-Hans  "ME Firmware Version"
#string STR_ME_FW_REV_PROMPT                          #language en-US  "ME FW Version"
                                                      #language zh-Hans  "ME FW Version"
#string STR_ME_FW_REV_VALUE                           #language en-US  "N/A" //dynamically updated
                                                      #language zh-Hans  "N/A" //dynamically updated
#string STR_CHIP_IGFX_VBIOS_REV_HELP                  #language en-US "IGFX VBIOS Version"
                                                      #language zh-Hans "IGFX VBIOS Version"
#string STR_CHIP_IGFX_VBIOS_REV_NAME                  #language en-US "IGFX VBIOS Version"
                                                      #language zh-Hans "IGFX VBIOS Version"
#string STR_CHIP_IGFX_VBIOS_REV_VALUE                 #language en-US "N/A" //dynamically updated
                                                      #language zh-Hans "N/A" //dynamically updated
#string STR_MRC_REV_HELP                              #language en-US "Memory RC Version"
                                                      #language zh-Hans "Memory RC Version"
#string STR_MRC_REV_NAME                              #language en-US "Memory RC Version"
                                                      #language zh-Hans "Memory RC Version"
#string STR_MRC_REV_VALUE                             #language en-US "N/A" //dynamically updated
                                                      #language zh-Hans "N/A" //dynamically updated
//
// BOARD INFORMATION
//
#string STR_BOARD_FORM_SUBTITLE                       #language en-US "Board Information"
                                                      #language zh-Hans "Board Information"
#string STR_BOARD_ID_HELP                             #language en-US "Displays the Board ID."
                                                      #language zh-Hans "Displays the Board ID."
#string STR_BOARD_ID_STRING                           #language en-US "Board ID"
                                                      #language zh-Hans "Board ID"
#string STR_BOARD_ID_VALUE                            #language en-US "N/A"
                                                      #language zh-Hans "N/A"
#string STR_FAB_ID_HELP                               #language en-US "Displays the Fab ID"
                                                      #language zh-Hans "Displays the Fab ID"
#string STR_FAB_ID_STRING                             #language en-US "Fab ID"
                                                      #language zh-Hans "Fab ID"
#string STR_FAB_ID_VALUE                              #language en-US "N/A"
                                                      #language zh-Hans "N/A"
#string STR_LAN_PHY_REV_HELP                          #language en-US "Displays LAN PHY Revision."
                                                      #language zh-Hans "Displays LAN PHY Revision."
#string STR_LAN_PHY_REV_STRING                        #language en-US "LAN PHY Revision"
                                                      #language zh-Hans "LAN PHY Revision"
#string STR_LAN_PHY_REV_VALUE                         #language en-US "N/A"
                                                      #language zh-Hans "N/A"

//
// PROCESSOR INFORMATION
//
#string STR_PROCESSOR_HELP                            #language en-US "Displays the Processor Details."
                                                      #language zh-Hans "Displays the Processor Details."
#string STR_PROCESSOR_STRING                          #language en-US "Name"
                                                      #language zh-Hans "Name"
#string STR_PROCESSOR_VALUE                           #language en-US "N/A"
                                                      #language zh-Hans "N/A"
//
// CPU INFORMATION
//
#string STR_CPU_FORM_SUBTITLE                         #language en-US "Processor Information"
                                                      #language zh-Hans "Processor Information"

#string STR_PROCESSOR_VERSION_HELP                    #language en-US "Displays the Processor Type."
                                                      #language zh-Hans "Displays the Processor Type."
#string STR_PROCESSOR_VERSION_STRING                  #language en-US "CPU Type"
                                                      #language zh-Hans "\wideCPU类型\narrow"
#string STR_PROCESSOR_VERSION_VALUE                   #language en-US "N/A"
                                                      #language zh-Hans "N/A"
#string STR_PROCESSOR_SPEED_STRING                    #language en-US "CPU Speed"
                                                      #language zh-Hans "\wideCPU频率\narrow"
#string STR_PROCESSOR_SPEED_VALUE                     #language en-US "N/A"
                                                      #language zh-Hans "N/A"
#string STR_PROCESSOR_SPEED_HELP                      #language en-US "Displays the Processor Speed."
                                                      #language zh-Hans "Displays the Processor Speed."
#string STR_PROCESSOR_CORE_COUNT_STRING               #language en-US "CPU Core Count"
                                                      #language zh-Hans "\wideCPU核心数量\narrow"
#string STR_PROCESSOR_CORE_COUNT_VALUE                #language en-US "N/A"

#string STR_CACHE_L1I_SIZE_STRING               #language en-US "Cache L1i Size"
#string STR_CACHE_L1I_SIZE_VALUE                #language en-US "N/A"
#string STR_CACHE_L1D_SIZE_STRING               #language en-US "Cache L1d Size"
#string STR_CACHE_L1D_SIZE_VALUE                #language en-US "N/A"
#string STR_CACHE_L2_SIZE_STRING               #language en-US "Cache L2 Size"
#string STR_CACHE_L2_SIZE_VALUE                #language en-US "N/A"
                                                      #language zh-Hans "N/A"


#string STR_PROCESSOR_ID_STRING                       #language en-US "ID"
                                                      #language zh-Hans "ID"
#string STR_PROCESSOR_ID_VALUE                        #language en-US "N/A"
                                                      #language zh-Hans "N/A"
#string STR_PROCESSOR_ID_HELP                         #language en-US "Displays the Processor ID."
                                                      #language zh-Hans "Displays the Processor ID."
#string STR_PROCESSOR_STEPPING_STRING                 #language en-US "Stepping"
                                                      #language zh-Hans "Stepping"
#string STR_PROCESSOR_STEPPING_VALUE                  #language en-US "Unknown"
                                                      #language zh-Hans "Unknown"
#string STR_PROCESSOR_STEPPING_HELP                   #language en-US "Displays the Processor Stepping."
                                                      #language zh-Hans "Displays the Processor Stepping."
#string STR_PROCESSOR_PACKAGE_STRING                  #language en-US "Package"
                                                      #language zh-Hans "Package"
#string STR_PROCESSOR_PACKAGE_VALUE                   #language en-US "N/A"
                                                      #language zh-Hans "N/A"
#string STR_PROCESSOR_PACKAGE_HELP                    #language en-US "Displays the Processor Package."
                                                      #language zh-Hans "Displays the Processor Package."
#string STR_PROCESSOR_MICROCODE_STRING                #language en-US "Microcode Revision"
                                                      #language zh-Hans "Microcode Revision"
#string STR_PROCESSOR_MICROCODE_VALUE                 #language en-US "Not loaded"
                                                      #language zh-Hans "Not loaded"
#string STR_PROCESSOR_MICROCODE_HELP                  #language en-US "CPU Microcode Revision"
                                                      #language zh-Hans "CPU Microcode Revision"
#string STR_PROCESSOR_COUNT_STRING                    #language en-US "CPU Count"
                                                      #language zh-Hans "CPU Count"
#string STR_PROCESSOR_COUNT_VALUE                     #language en-US "N/A"
                                                      #language zh-Hans "N/A"
#string STR_PROCESSOR_COUNT_HELP                      #language en-US "Displays number of CPU."
                                                      #language zh-Hans "Displays number of CPU."
#string STR_PROCESSOR_GT_STRING                       #language en-US "GT Info"
                                                      #language zh-Hans "GT Info"
#string STR_PROCESSOR_GT_VALUE                        #language en-US "Not Applicable"
                                                      #language zh-Hans "Not Applicable"
#string STR_PROCESSOR_GT_HELP                         #language en-US "Processor GT Info. Only valid if SNB stepping is D0 or above."
                                                      #language zh-Hans "Processor GT Info. Only valid if SNB stepping is D0 or above."
//
// NB Information
//
#string STR_NB_INFORMATION                            #language en-US "UnCore Information"
                                                      #language zh-Hans "UnCore Information"
#string STR_MEMORY_FREQ_NAME                          #language en-US "Memory Bus Speed"
                                                      #language zh-Hans "\wide内存频率\narrow"
#string STR_MEMORY_FREQ_HELP                          #language en-US "Displays the Frequency of Memory"
                                                      #language zh-Hans "Displays the Frequency of Memory"
#string STR_MEMORY_FREQ_VALUE                         #language en-US "N/A" // Dynamically updated
                                                      #language zh-Hans "N/A" // Dynamically updated
#string STR_MEMORY_SIZE_NAME                          #language en-US "Installed Memory"
                                                      #language zh-Hans "\wide已安装内存\narrow"
#string STR_MEMORY_SIZE_VALUE                         #language en-US "N/A" // Dynamically updated
                                                      #language zh-Hans "N/A" // Dynamically updated
#string STR_MEMORY_SIZE_HELP                          #language en-US "Total Memory in the System."
                                                      #language zh-Hans "Total Memory in the System."
#string STR_SB_INFORMATION                            #language en-US "PCH Information"
                                                      #language zh-Hans "PCH Information"
#string STR_ACTIVE_VIDEO_NAME                         #language en-US "Active Video"
                                                      #language zh-Hans "\wide有效显示\narrow"
#string STR_ACTIVE_VIDEO_VALUE                        #language en-US "Enabled"
                                                      #language zh-Hans "\wide打开\narrow"
#string STR_ONBOARD_AUDIO_NAME                        #language en-US "Onboard Audio"
                                                      #language zh-Hans "\wide板载音频\narrow"
#string STR_ONBOARD_AUDIO_VALUE                       #language en-US "Enabled"
                                                      #language zh-Hans "\wide打开\narrow"
#string STR_ONBOARD_ETHERNET_NAME                     #language en-US "Onboard Ethernet"
                                                      #language zh-Hans "\wide板载网卡\narrow"
#string STR_ONBOARD_ETHERNET_VALUE                    #language en-US "Enabled"
                                                      #language zh-Hans "\wide打开\narrow"
#string STR_OPERATING                                 #language en-US "Operating"
                                                      #language zh-Hans "\wide运转\narrow"
#string STR_NOT_OPERATING                             #language en-US "Not Operating"
                                                      #language zh-Hans "\wide运转\narrow"
#string STR_CPU_FAN_NAME                              #language en-US "CPU Fan"
                                                      #language zh-Hans "\wideCPU风扇\narrow"
#string STR_CPU_FAN_VALUE                             #language en-US "Not Operating"
                                                      #language zh-Hans "\wide未运转\narrow"

#string STR_SYSTEM_FAN_NAME                           #language en-US "System Fan"
                                                      #language zh-Hans "\wide系统风扇\narrow"
#string STR_SYSTEM_FAN_VALUE                          #language en-US "Not Operating"
#string STR_POWER_FAN_NAME                            #language en-US "Aux Fan"
#string STR_POWER_FAN_VALUE                           #language en-US "Not Operating"
#string STR_POWER_FAN_NAME2                           #language en-US "Aux Fan 2"
#string STR_POWER_FAN_VALUE2                          #language en-US "Not Operating"
#string STR_SATA_DRIVE0_NAME                          #language en-US "SATA Drive 0"
#string STR_SATA_DRIVE0_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE1_NAME                          #language en-US "SATA Drive 1"
#string STR_SATA_DRIVE1_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE2_NAME                          #language en-US "SATA Drive 2"
#string STR_SATA_DRIVE2_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE3_NAME                          #language en-US "SATA Drive 3"
#string STR_SATA_DRIVE3_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE4_NAME                          #language en-US "SATA Drive 4"
#string STR_SATA_DRIVE4_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE5_NAME                          #language en-US "SATA Drive 5"
#string STR_SATA_DRIVE5_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE6_NAME                          #language en-US "SATA Drive 6"
#string STR_SATA_DRIVE6_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE7_NAME                          #language en-US "SATA Drive 7"
#string STR_SATA_DRIVE7_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE8_NAME                          #language en-US "SATA Drive 8"
#string STR_SATA_DRIVE8_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE9_NAME                          #language en-US "SATA Drive 9"
#string STR_SATA_DRIVE9_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE10_NAME                          #language en-US "SATA Drive 10"
#string STR_SATA_DRIVE10_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE11_NAME                          #language en-US "SATA Drive 11"
#string STR_SATA_DRIVE11_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE12_NAME                          #language en-US "SATA Drive 12"
#string STR_SATA_DRIVE12_VALUE                         #language en-US "Not Present"
#string STR_SATA_DRIVE13_NAME                          #language en-US "SATA Drive 13"
#string STR_SATA_DRIVE13_VALUE                         #language en-US "Not Present"

#string STR_MEM_SLOT0_STRING                    #language en-US "Memory Slot0"
#string STR_MEM_SLOT0_VALUE                     #language en-US "Not Present"

#string STR_MEM_SLOT1_STRING                    #language en-US "Memory Slot1"
#string STR_MEM_SLOT1_VALUE                     #language en-US "Not Present"

#string STR_MEM_SLOT2_STRING                    #language en-US "Memory Slot2"
#string STR_MEM_SLOT2_VALUE                     #language en-US "Not Present"

#string STR_MEM_SLOT3_STRING                    #language en-US "Memory Slot3"
#string STR_MEM_SLOT3_VALUE                     #language en-US "Not Present"

#string STR_SYSTEM_SUMMARY                      #language en-US "System Summary"
#string STR_LAN_MAC_ADDR_NAME                   #language en-US "Onboard LAN MAC Address"
#string STR_LAN_MAC_ADDR_VALUE                  #language en-US "Invalid"

#string STR_CHIP_VERSION_STRING                 #language en-US "Chip Version(NB/SB)"
#string STR_CHIP_VERSION_VALUE                  #language en-US "Unknown"
